<?php
/*********************************************
*
* 程序名： php爱好者留言簿
* 演  示： http://www.phpfans.net/guestbook/
*
* 作 者： 我不是鱼
* Email： deng5765@163.com
* 网 址： http://www.phpfans.net
* 博 客:  http://www.phpfans.net/space/?2
*
* 版本： v2.0
* 帮助： http://www.phpfans.net/guestbook/
* 问题建议： http://www.phpfans.net/bbs/forumdisplay.php?fid=24&page=1
* 更新日志： http://www.phpfans.net/bbs/viewthread.php?tid=6345&extra=page%3D1
* php爱好者站：http://www.phpfans.net
* php爱好者论坛： http://www.phpfans.net/bbs/
*
*********************************************/

$mearr = array (
  'm1' => '非常感谢，您的留言已经发布，现在将转入留言簿主页。',
  'm10' => '你发布留言过快，请休息一阵再发。',
  'm11' => '置顶/解除置顶留言成功，你进入前的页面。',
  'm12' => '你已经登陆。请勿重复登陆。',
  'm13' => '验证码已经过期，请重新发言。',
  'm14' => '验证码不正确，请重新填写。',
  'm15' => 'email格式不正确，请重新填写。',
  'm16' => '登陆成功，现在跳转到你登陆前的页面。',
  'm17' => '用户名或密码有误，请重新登陆。',
  'm18' => '已经成功退出，现在跳转到你退出前的页面。',
  'm19' => '昵称不能为空。',
  'm2' => '您的回复已经发布，现在将转入你进入前的页面。',
  'm20' => '验证码不能为空。',
  'm21' => '验证码不正确。',
  'm22' => 'Email格式不正确。',
  'm23' => 'QQ号码不正确。',
  'm24' => '主页地址不正确。',
  'm25' => '编辑留言成功，现在将转入你进入前的页面。',
  'm26' => '请先登陆再进行管理。',
  'm3' => '删除留言成功，现在将转入你进入前的页面。',
  'm4' => '昵称或内容不能为空，请从新签写留言。',
  'm5' => '你输入的管理员密码不正确，你不具备操作的权限。',
  'm6' => '发布的信息必须含有一个汉字，谢谢合作。',
  'm7' => '你发布的留言包括本站视为敏感的字符，本站拒绝你发言。',
  'm8' => '你的ip已经在本站黑名单中，本站拒绝你发言。',
  'm9' => '你发布的留言超过本站设置的最大长度，请从新签写留言。',
);
?>